Autodesk.Revit.DB.ColorFillScheme.IsValidSchemeName(System.String)
Whether input string is valid scheme name.
Returns:
Returns true if the string is valid scheme name, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.CanUpdateEntry(System.Int32,Autodesk.Revit.DB.ColorFillSchemeEntry)
Checks whether entry under specified index can be updated with new value.
index:
The index of the entry.
entry:
New entry value.
Returns:
Returns true if entry can be updated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.CanRemoveEntry(System.Int32)
Checks whether entry, with specefied index, can be removed from the scheme.
index:
The index of the entry.
Returns:
Returns true if entry can be removed from the scheme, false otherwise.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.CanRemoveEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Checks whether entry can be removed from the scheme.
entry:
The entry.
Returns:
Returns true if entry can be removed from the scheme, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.Duplicate(System.String)
Creates a copy of current color fill scheme
name:
Name of the copy.
Returns:
Id of created copy.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The name is not valid string for scheme name or scheme with such name already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InternalException:
Cannot duplicate area scheme. It has invalid area scheme id.
-or-
Cannot duplicate zone scheme. It has invalid zone scheme id.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.RemoveColorFillEntry(System.Int32)
Removes ColorFillEntry by its index.
Index of the entry.
Remarks:
If ColorFillSchemeEntry.InUse is true, the entry can not be deleted from the scheme.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is out of entries range.
-or-
The entry with index cannot be removed from the scheme.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.RemoveColorFillEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Removes ColorFillEntry from the scheme.
The entry.
Remarks:
If ColorFillSchemeEntry.InUse is true, the entry can not be deleted from the scheme.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The entry does not exist in the scheme.
-or-
The entry cannot be removed from the scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.IsEntryConsistentWithScheme(Autodesk.Revit.DB.ColorFillSchemeEntry)
Checks whether entry can be added to the scheme or not.
entry:
Entry to check.
Returns:
State of Entry and Scheme consistency.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.AddColorFillEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Adds new entry to the ColorFillScheme.
Remarks:
To make sure that entry can be added to the scheme call isEntryConsitentWithScheme(entry) first.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The entry already exists in the scheme.
-or-
The color fill scheme and the entry have different ByRange value.
-or-
The color fill scheme and the entry have different parameter storage type value.
-or-
The color fill scheme entry references invalid element or element which can not be used by scheme parameter.
-or-
The entry value is out of range of valid values of scheme parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.GetEntriesCount
Returns number of entries in the ColorFillScheme.
Remarks:
This method recalculates entries, which can be slow if the document has changed since last color fill calculation.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.SetEntry(System.Int32,Autodesk.Revit.DB.ColorFillSchemeEntry)
Updates entry by index.
Remarks:
Updates entry Color, FillPattern and IsVisible properties.
New entry should have same storage type and same value as entry at the specified index.
index:
Entry index.
entry:
New entry value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is out of entries range.
-or-
Entry at specified index and new value have different storage type or different values. The entry cannot be updated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.GetEntry(System.Int32)
Returns ColorFillSchemeEntry by its index.
index:
Entry index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is out of entries range.
-or-
The scheme does not have entries.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.GetEntries
Returns copies of all ColorFillScheme entries.
Remarks:
This method recalculates entries, which can be slow if the document has changed since last color fill calculation.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.StorageType
The StorageType of the parameter that is used to define scheme entries.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.CategoryId
The id of the category which current ColorFillScheme supports.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.ParameterDefinition
The parameter Id that this scheme is used to color filled.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.Title
The title of the ColorFillScheme.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme.ByRange
True if ColorFillSchemeEntry values specified by range, false if by value.
Since:
2021

Autodesk.Revit.DB.ColorFillScheme
Represents color fill scheme element in Revit.
Since:
2021